title: Detect Macro or Script Engine Activation from Office Apps
id: b2e8e8f7-3e49-43c7-b07c-1661b4ed4bb3
description: Detects Office application spawning a scripting engine, often as a result of malicious macro or embedded script execution.
status: production
author: auto-generated
date: 2025-07-13
logsource:
  category: custom
  product: windows
detection:
  selection:
    relation: Process Create
    srcNode.Image|endswith:
      - winword.exe
      - excel.exe
      - powerpnt.exe
    dstNode.Image|endswith:
      - powershell.exe
      - cmd.exe
      - wscript.exe
      - mshta.exe
      - rundll32.exe
  condition: selection
tags:
  - attack.t1566.001
  - attack.execution
level: high