title: Detect Network Connections from Unusual Processes Post-Execution
id: b24a4d83-edd1-41a4-90a3-6bb509dd24e1
description: Detects outbound network connections from non-browser, non-system processes, especially those related to child processes of Office or scripting engines.
status: production
author: auto-generated
date: 2025-07-13
logsource:
  category: custom
  product: windows
detection:
  selection:
    relation: TCP Connect
    srcNode.Image|endswith:
      - powershell.exe
      - cmd.exe
      - rundll32.exe
      - mshta.exe
      - wget.exe
      - curl.exe
      - bitsadmin.exe
      - .exe
    dstNode.Port|contains:
      - 80
      - 443
  condition: selection
tags:
  - attack.t1566.001
  - attack.command_and_control
level: high